# FamilyPointLocation Properties

---
The FamilyPointLocation type exposes the following members.
| Name| Description
---|---|---
| IsReadOnly| Identifies if the object is read-only or modifiable.(Inherited from APIObject)
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| Name|  The name of the corresponding reference point in the Family document.
Top
#### Reference
FamilyPointLocation Class
Autodesk.Revit.DB Namespace